Repository: ievgen-pavlenko/hackathonJessy_bot
Catalog: locales/*/LC_MESSAGES/bot.po
Languages: pl, uk

source: Welcome, {user_name}!
pl: Witaj, {user_name}!
uk: Ласкаво просимо, {user_name}!

source: Main menu
pl: Menu główne
uk: Головне меню

source: Language selection
pl: Wybór języka
uk: Вибір мови

source: Please select your language:
pl: Proszę wybrać język:
uk: Будь ласка, оберіть вашу мову:

source: Language has been changed to {language}.
pl: Język został zmieniony na {language}.
uk: Мову було змінено на {language}.

source: Joke
pl: Żart
uk: Жарт

source: Statistics
pl: Statystyka
uk: Статистика

source: Admin Panel
pl: Panel administratora
uk: Адмін панель

source: ℹ️ **Bot Information** **Bot Name:** {bot_name} **Version:** {bot_version} **Status:** ✅ Online **Features:** • Personalized Jokes API • User Statistics • Admin Panel • Interactive Menus **Developer:** {developer} **Created:** 2025
pl: ℹ️ **Informacje o bocie** **Nazwa bota:** {bot_name} **Wersja:** {bot_version} **Status:** ✅ Online **Funkcje:** • API do personalizowanych żartów • Statystyki użytkowników • Panel administratora • Interaktywne menu **Deweloper:** {developer} **Utworzono:** 2025
uk: ℹ️ **Інформація про бота** **Ім'я бота:** {bot_name} **Версія:** {bot_version} **Статус:** ✅ Онлайн **Можливості:** • API для персоналізованих жартів • Статистика користувачів • Панель адміністратора • Інтерактивні меню **Розробник:** {developer} **Створено:** 2025

source: ⚙️ Settings
pl: ⚙️ Ustawienia
uk: ⚙️ Налаштування

source: ℹ️ About
pl: ℹ️ O bocie
uk: ℹ️ Про бота

source: ❓ Help
pl: ❓ Pomoc
uk: ❓ Допомога

source: ⚙️ **Settings** **Available Settings:** • Language: {language} • Notifications: Enabled • Privacy: Standard **Coming Soon:** • Custom themes • Advanced preferences • User profiles
pl: ⚙️ **Ustawienia** **Dostępne ustawienia:** • Język: {language} • Powiadomienia: Włączone • Prywatność: Standardowa **Wkrótce:** • Własne motywy • Zaawansowane preferencje • Profile użytkowników
uk: ⚙️ **Налаштування** **Доступні налаштування:** • Мова: {language} • Сповіщення: Увімкнено • Приватність: Стандартна **Незабаром:** • Власні теми • Розширені налаштування • Профілі користувачів

source: 🔙 Back to Menu
pl: 🔙 Wróć do menu
uk: 🔙 Назад до меню

source: Change Language
pl: Zmień język
uk: Змінити мову

source: 🆘 **Help & Commands** **Basic Commands:** /start - Start the bot and see welcome message /help - Show this help message /info - Get bot information /menu - Show interactive menu **Features:** • Interactive buttons and menus • Echo messages back to you • User-friendly interface • Error handling
pl: 🆘 **Pomoc i polecenia** **Podstawowe polecenia:** /start - Uruchom bota i zobacz wiadomość powitalną /help - Pokaż tę wiadomość /info - Uzyskaj informacje o bocie /menu - Pokaż interaktywne menu **Funkcje:** • Interaktywne przyciski i menu • Odsyłanie twojej wiadomości • Przyjazny interfejs • Obsługa błędów
uk: 🆘 **Допомога та команди** **Основні команди:** /start - Запустити бота та побачити вітальне повідомлення /help - Показати це повідомлення /info - Отримати інформацію про бота /menu - Показати інтерактивне меню **Можливості:** • Інтерактивні кнопки та меню • Повернення вашого повідомлення • Дружній інтерфейс • Обробка помилок

source: 📝 You said: {user_message}
pl: 📝 Powiedziałeś: {user_message}
uk: 📝 Ви сказали: {user_message}

source: 🎭 Creating a joke for you...
pl: 🎭 Tworzę dla Ciebie żart...
uk: 🎭 Створюю жарт для вас...

source: 🎭 Fetching a joke for you...
pl: 🎭 Pobieram dla Ciebie żart...
uk: 🎭 Отримую жарт для вас...

source: Tell me a joke
pl: Opowiedz mi dowcip
uk: Розкажи анекдот

source: 🤖 I'm a joke bot! Here's what I can do: • Send me any text and I'll create a personalized joke • Use /joke to get a random joke • Use /menu to see all available commands • Use /help for more information Try sending me something like "Tell me a programming joke" or "I want a dad joke"!
pl: 🤖 Jestem botem do żartów! Oto co potrafię: • Wyślij mi dowolny tekst, a ja stworzę spersonalizowany żart • Użyj /joke, aby otrzymać losowy żart • Użyj /menu, aby zobaczyć wszystkie dostępne polecenia • Użyj /help, aby uzyskać więcej informacji Spróbuj wysłać mi coś w stylu "Opowiedz mi żart o programistach" lub "Chcę żart tatusia"!
uk: 🤖 Я бот для жартів! Ось що я вмію: • Надішліть мені будь-який текст, і я створю персоналізований жарт • Використовуйте /joke, щоб отримати випадковий жарт • Використовуйте /menu, щоб побачити всі доступні команди • Використовуйте /help для отримання додаткової інформації Спробуйте надіслати мені щось на зразок "Розкажи жарт про програмістів" або "Хочу татівський жарт"!

source: 🎭 Create Joke
pl: 🎭 Stwórz żart
uk: 🎭 Створити жарт

source: 📋 Menu
uk: 📋 Меню

source: 🎭 Another Joke
pl: 🎭 Inny żart
uk: 🎭 Інший жарт

source: 🤖 Welcome to {bot_name}, {user_name}! I'm your personal assistant bot with the following features: • 🎭 Personalized jokes based on your input • 📊 Bot statistics and analytics • 🎛️ Interactive menu system • ⚙️ Admin panel for administrators Use /help to see all available commands!
pl: 🤖 Witaj w {bot_name}, {user_name}! Jestem Twoim osobistym asystentem z następującymi funkcjami: • 🎭 Spersonalizowane żarty na podstawie Twojego wkładu • 📊 Statystyki i analityka bota • 🎛️ Interaktywny system menu • ⚙️ Panel administratora dla administratorów Użyj /help, aby zobaczyć wszystkie dostępne polecenia!
uk: 🤖 Ласкаво просимо до {bot_name}, {user_name}! Я ваш особистий помічник з наступними можливостями: • 🎭 Персоналізовані жарти на основі вашого вводу • 📊 Статистика та аналітика бота • 🎛️ Інтерактивна система меню • ⚙️ Панель адміністратора для адміністраторів Використовуйте /help, щоб побачити всі доступні команди!

source: 🆘 **Help & Commands** **Basic Commands:** /start - Start the bot and see welcome message /help - Show this help message /info - Get bot information /menu - Show interactive menu /joke - Get a random joke /stats - Show bot statistics /admin - Admin panel (admin only) **Features:** • Interactive buttons and menus • Personalized jokes from external API • User input processing • User-friendly interface • Error handling **How to use:** 1. Use the buttons below for quick actions 2. Send any text message to get a personalized joke 3. Use /menu to access all features
pl: 🆘 **Pomoc i polecenia** **Podstawowe polecenia:** /start - Uruchom bota i zobacz wiadomość powitalną /help - Pokaż tę wiadomość /info - Uzyskaj informacje o bocie /menu - Pokaż interaktywne menu /joke - Otrzymaj losowy żart /stats - Pokaż statystyki bota /admin - Panel administratora (tylko dla administratorów) **Funkcje:** • Interaktywne przyciski i menu • Spersonalizowane żarty z zewnętrznego API • Przetwarzanie danych wejściowych użytkownika • Przyjazny interfejs • Obsługa błędów **Jak używać:** 1. Użyj przycisków poniżej, aby szybko wykonać akcje 2. Wyślij dowolną wiadomość tekstową, aby otrzymać spersonalizowany żart 3. Użyj /menu, aby uzyskać dostęp do wszystkich funkcji
uk: 🆘 **Допомога та команди** **Основні команди:** /start - Запустити бота та побачити вітальне повідомлення /help - Показати це повідомлення /info - Отримати інформацію про бота /menu - Показати інтерактивне меню /joke - Отримати випадковий жарт /stats - Показати статистику бота /admin - Панель адміністратора (тільки для адміністраторів) **Можливості:** • Інтерактивні кнопки та меню • Персоналізовані жарти з зовнішнього API • Обробка вводу користувача • Дружній інтерфейс • Обробка помилок **Як використовувати:** 1. Використовуйте кнопки нижче для швидких дій 2. Надішліть будь-яке текстове повідомлення, щоб отримати персоналізований жарт 3. Використовуйте /menu, щоб отримати доступ до всіх функцій

source: 😅 Sorry, something went wrong. Please try again!
pl: 😅 Przepraszam, coś poszło nie tak. Proszę spróbować ponownie!
uk: 😅 Вибачте, щось пішло не так. Будь ласка, спробуйте ще раз!

source: 😅 Sorry, couldn't get statistics right now. Try again later!
pl: 😅 Przepraszam, nie udało się teraz pobrać statystyk. Spróbuj ponownie później!
uk: 😅 Вибачте, не вдалося отримати статистику зараз. Спробуйте пізніше!

source: 😅 Sorry, couldn't get admin data right now. Try again later!
pl: 😅 Przepraszam, nie udało się teraz pobrać danych administratora. Spróbuj ponownie później!
uk: 😅 Вибачте, не вдалося отримати дані адміністратора зараз. Спробуйте пізніше!

source: 😅 Sorry, I couldn't fetch a joke right now. Try again later!
pl: 😅 Przepraszam, nie udało mi się teraz pobrać żartu. Spróbuj ponownie później!
uk: 😅 Вибачте, я не зміг отримати жарт зараз. Спробуйте пізніше!

source: ❌ Access denied. This command is for administrators only.
pl: ❌ Dostęp zabroniony. To polecenie jest tylko dla administratorów.
uk: ❌ Доступ заборонено. Ця команда лише для адміністраторів.

source: Statistics unavailable
pl: Statystyki niedostępne
uk: Статистика недоступна

source: Unknown
pl: Nieznany
uk: Невідомо

source: d
uk: д

source: h
pl: g
uk: г

source: m
uk: хв

source: s
uk: с

source: 📊 <b>Bot Statistics</b>
pl: 📊 <b>Statystyki bota</b>
uk: 📊 <b>Статистика бота</b>

source: 🕐 <b>Last Restart:</b>
pl: 🕐 <b>Ostatni restart:</b>
uk: 🕐 <b>Останній запуск:</b>

source: ⏱️ <b>Uptime:</b>
pl: ⏱️ <b>Czas pracy:</b>
uk: ⏱️ <b>Час роботи:</b>

source: 👥 <b>Users:</b>
pl: 👥 <b>Użytkownicy:</b>
uk: 👥 <b>Користувачі:</b>

source: • Total:
pl: • Razem:
uk: • Всього:

source: • Last 24h:
pl: • Ostatnie 24h:
uk: • За останні 24 год:

source: 📨 <b>Messages:</b>
pl: 📨 <b>Wiadomości:</b>
uk: 📨 <b>Повідомлення:</b>

source: • Commands:
pl: • Polecenia:
uk: • Команд:

source: 🔥 <b>Top Commands:</b>
pl: 🔥 <b>Najlepsze polecenia:</b>
uk: 🔥 <b>Топ команд:</b>

source: • No data
pl: • Brak danych
uk: • Немає даних

source: Users not found
pl: Nie znaleziono użytkowników
uk: Користувачі не знайдені

source: 👥 <b>Users List:</b>
pl: 👥 <b>Lista użytkowników:</b>
uk: 👥 <b>Список користувачів:</b>

source: No username
pl: Brak nazwy użytkownika
uk: Без username

source: Last visit:
pl: Ostatnia wizyta:
uk: Останній візит:

source: Messages:
pl: Wiadomości:
uk: Повідомлень:

source: ... and {count} more users
pl: ... i jeszcze {count} użytkowników
uk: ... та ще {count} користувачів

source: No name
pl: Brak imienia
uk: Без імені

source: 🔄 Try Again
pl: 🔄 Spróbuj ponownie
uk: 🔄 Спробувати ще раз

source: 🔄 Refresh
pl: 🔄 Odśwież
uk: 🔄 Оновити

source: User
pl: Użytkownik
uk: Користувач

source: 📞 **Contact** **Get in Touch:** • Developer: {developer} • Email: {email} • GitHub: {github} • Support: Available 24/7 **Report Issues:** • Use /help for assistance • Send feedback via messages • Report bugs directly
pl: 📞 **Kontakt** **Skontaktuj się:** • Deweloper: {developer} • Email: {email} • GitHub: {github} • Wsparcie: Dostępne 24/7 **Zgłoś problemy:** • Użyj /help, aby uzyskać pomoc • Wyślij opinię w wiadomościach • Zgłaszaj błędy bezpośrednio
uk: 📞 **Контакти** **Зв'язок:** • Розробник: {developer} • Email: {email} • GitHub: {github} • Підтримка: Доступна 24/7 **Повідомити про проблеми:** • Використовуйте /help для допомоги • Надішліть відгук у повідомленнях • Повідомляйте про помилки безпосередньо

source: 🎭 **Joke Generator** Send me any text and I'll create a personalized joke for you! **Examples:** • "Tell me a programming joke" • "I want a dad joke" • "Make me laugh about cats" • Or just send any text! I'll create a personalized joke for you! 😄
pl: 🎭 **Generator żartów** Wyślij mi dowolny tekst, a ja stworzę dla Ciebie spersonalizowany żart! **Przykłady:** • "Opowiedz mi żart o programistach" • "Chcę żart tatusia" • "Rozśmiesz mnie żartem o kotach" • Lub po prostu wyślij dowolny tekst! Stworzę dla Ciebie spersonalizowany żart! 😄
uk: 🎭 **Генератор жартів** Надішліть мені будь-який текст, і я створю для вас персоналізований жарт! **Приклади:** • "Розкажи жарт про програмістів" • "Хочу татівський жарт" • "Насміши мене жартом про котів" • Або просто надішліть будь-який текст! Я створю для вас персоналізований жарт! 😄
